src/cf/src/Documents/СверкаВзаиморасчётов/СверкаВзаиморасчётов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СверкаВзаиморасчётов</name>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйОстаток</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйОстаток</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Расходждение</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧПоДаннымОрганизации</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратПоставщику</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПредставление</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Дебет</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Кредит</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоСтавокНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаНДС</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧПоДаннымКонтрагента</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратПоставщику</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПредставление</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Дебет</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Кредит</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/СверкаВзаиморасчётов/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = Объект.НачалоПериода;
	Период.ДатаОкончания = Объект.КонецПериода;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ТорговаяТочкаПриИзменении(Элемент)
	ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Объект.Контрагент, Объект.Организация, Истина, Объект.Дата);
	ЗаполнитьЗначенияСвойств(Объект, ДанныеКонтрагента, "Контрагент, Договор");
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.НачалоПериода = Период.ДатаНачала;
	Объект.КонецПериода = Период.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ТЧПоДаннымОрганизацииПриИзменении(Элемент)
	Объект.КонечныйОстаток = Объект.НачальныйОстаток + Объект.ТЧПоДаннымОрганизации.Итог("Дебет") - Объект.ТЧПоДаннымОрганизации.Итог("Кредит");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымОрганизации(Команда)
	Если Не ПроверитьЗаполнение() Тогда Возврат КонецЕсли;
	Если Не ПроверитьПравильностьДанных() Тогда Возврат КонецЕсли;
	ПолучитьОстаткиИОборотыПоКонтрагенту(Истина); 
	Для Каждого ТекСтр из Объект.ТЧПоДаннымОрганизации Цикл 
		ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.ДокументРегистратор);
		ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымКонтрагента(Команда)
	Если Не ПроверитьЗаполнение() Тогда Возврат КонецЕсли;
	Если Не ПроверитьПравильностьДанных() Тогда Возврат КонецЕсли;
	ПолучитьОстаткиИОборотыПоКонтрагенту(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТЧПоДаннымОрганизацииДокументРегистраторПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧОснования.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.ДокументРегистратор);
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧПоДаннымОрганизацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ТЧПоДаннымОрганизацииСтавкаНДС Или Поле = Элементы.ТЧПоДаннымОрганизацииСуммаНДС Тогда
		ТекСтр = Объект.ТЧПоДаннымОрганизации.НайтиПоИдентификатору(ВыбраннаяСтрока);
		РаботаСДокументамиКлиент.РедактироватьСуммыНДСПлатёжногоДокумента(ТекСтр, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияНДСПлатёжногоДокумента(МасДанные, СтрОснованиеПлатежа) Экспорт
	Если МасДанные = Неопределено Тогда Возврат КонецЕсли;
	Модифицированность = Истина;
	РаботаСДокументамиКлиент.ЗаполнитьСуммыНДСПлатёжногоДокумента(СтрОснованиеПлатежа, МасДанные);
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаКлиенте
Функция ПроверитьПравильностьДанных()
	Результат = Истина;
	ТекстОшибки = "";
	Если Объект.НачалоПериода > Объект.КонецПериода Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ТекстОшибки, Нстр("fr = 'Date de début de période > date de fin de période'; ru = 'Дата начала периода > даты окончания периода'; en = 'Period start date \u003e Period end dates'; es = 'Fecha de Inicio del período \u003e fechas de finalización del período'"));
		Результат = Ложь;
	КонецЕсли;
	Если Результат = Ложь Тогда
		ПоказатьПредупреждение(, ТекстОшибки,, "Внимание");	
	КонецЕсли;	
	Возврат Результат;
КонецФункции	

&НаСервере
Процедура ПолучитьОстаткиИОборотыПоКонтрагенту(ПоДаннымОрганизации)
	Об = РеквизитФормыВЗначение("Объект");
	Об.ПолучитьОстаткиИОборотыПоКонтрагенту(ПоДаннымОрганизации);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

#КонецОбласти
